Source/ProductSearch/examples/GetAllProductsRequest.xml

<!--This is an example to test the Find All Products Request-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAllProductsRequest>
        </gs:getAllProductsRequest>
    </soapenv:Body>
</soapenv:Envelope>